yunline/contest2026_062_PharosTech/drivers/net/esp8266/esp8266_netdev.c
/****************************************************************************
 * contest2026_062_PharosTech/drivers/net/esp8266/esp8266_netdev.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_ESP8266_NETDEV

#include <stdint.h>
#include <stddef.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <fcntl.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>
#include <time.h>

#include <arpa/inet.h>

#include <net/if_arp.h>

#include <nuttx/clock.h>
#include <nuttx/kmalloc.h>
#include <nuttx/kthread.h>
#include <nuttx/semaphore.h>
#include <nuttx/signal.h>
#include <nuttx/spinlock.h>

#include <nuttx/net/netdev_lowerhalf.h>
#include <nuttx/net/ip.h>

#include "esp8266_netdev.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Timeouts (milliseconds) */

#define ESP8266_TIMEOUT_MS            1000
#define ESP8266_TIMEOUT_FLUSH_MS       100
#define ESP8266_TIMEOUT_SEND          1000
#define ESP8266_TIMEOUT_SCAN          5000
#define ESP8266_TIMEOUT_CONNECT      30000
#define ESP8266_FLOODING_OFFSET_S        3

/* Worker polling interval (milliseconds) - how long file_read blocks per poll */

#define ESP8266_POLLING_MS            1000

/* Socket flags (mirror apps/netutils/esp8266/esp8266.c) */

#define SOCK_FLAGS_USED       (1 << 0)
#define SOCK_FLAGS_CONNECTED  (1 << 1)
#define SOCK_FLAGS_TYPE_MASK  (3 << 2)
#define SOCK_FLAGS_TYPE_TCP   (0 << 2)
#define SOCK_FLAGS_TYPE_UDP   (1 << 2)

/* Buffer aliases */

#define BUF_ANS_LEN      CONFIG_ESP8266_NETDEV_AT_LINEBUF
#define BUF_CMD_LEN      CONFIG_ESP8266_NETDEV_AT_LINEBUF
#define BUF_WORKER_LEN   CONFIG_ESP8266_NETDEV_AT_LINEBUF

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Forward cast helper */
static struct esp8266_lowerhalf_s *
esp8266_priv(struct netdev_lowerhalf_s *dev);

/* Low-level UART I/O */
static int  esp8266_low_read(struct esp8266_lowerhalf_s *priv,
                             uint8_t *buf, int size);
static int  esp8266_vsend_cmd(struct esp8266_lowerhalf_s *priv,
                              const IPTR char *format, va_list ap);
static int  esp8266_send_cmd(struct esp8266_lowerhalf_s *priv,
                             const IPTR char *format, ...);

/* AT response reading */
static int  esp8266_read(struct esp8266_lowerhalf_s *priv,
                         int timeout_ms);
static void esp8266_flush(struct esp8266_lowerhalf_s *priv);
static int  esp8266_read_ans_ok(struct esp8266_lowerhalf_s *priv,
                                int timeout_ms);
static int  esp8266_ask_ans_ok(struct esp8266_lowerhalf_s *priv,
                               int timeout_ms,
                               const IPTR char *format, ...);
static int  esp8266_check(struct esp8266_lowerhalf_s *priv);

/* Socket management */
static struct esp8266_socket_s *
esp8266_get_sock(struct esp8266_lowerhalf_s *priv, int sockfd);
static void esp8266_sock_closed(struct esp8266_lowerhalf_s *priv,
                                int sockfd);

/* Data path */
static int  esp8266_read_ipd(struct esp8266_lowerhalf_s *priv,
                             int sockfd, int len);
static void esp8266_rx_avail(struct esp8266_lowerhalf_s *priv,
                             int sockfd);

/* Worker thread */
static int  esp8266_worker(int argc, char *argv[]);

/* Utility */
static inline int
esp8266_str_to_unsigned(char **p_ptr, char end);

/* AT response parsers */
static int  esp8266_parse_cwjap_ans_line(char *ptr,
                                         struct iw_point *iwp);
static int  esp8266_parse_cwlap_to_ap(char *line,
                                       struct esp8266_ap_s *ap);
static int  esp8266_parse_cipxxx_ans_line(const char *ptr,
                                          in_addr_t *ip);
static int  esp8266_serialize_scan_events(struct esp8266_lowerhalf_s *priv,
                                           struct iw_point *iwp);

/* netdev_lowerhalf ops */
static int  esp8266_ifup(struct netdev_lowerhalf_s *dev);
static int  esp8266_ifdown(struct netdev_lowerhalf_s *dev);
static int  esp8266_transmit(struct netdev_lowerhalf_s *dev,
                             netpkt_t *pkt);
static netpkt_t *esp8266_receive(struct netdev_lowerhalf_s *dev);
static void esp8266_reclaim(struct netdev_lowerhalf_s *dev);

#ifdef CONFIG_NETDEV_WIRELESS_HANDLER
/* Wireless ops */
static int  esp8266_iw_connect(struct netdev_lowerhalf_s *dev);
static int  esp8266_iw_disconnect(struct netdev_lowerhalf_s *dev);
static int  esp8266_iw_essid(struct netdev_lowerhalf_s *dev,
                             struct iwreq *iwr, bool set);
static int  esp8266_iw_bssid(struct netdev_lowerhalf_s *dev,
                             struct iwreq *iwr, bool set);
static int  esp8266_iw_passwd(struct netdev_lowerhalf_s *dev,
                              struct iwreq *iwr, bool set);
static int  esp8266_iw_scan(struct netdev_lowerhalf_s *dev,
                            struct iwreq *iwr, bool set);
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct netdev_ops_s g_esp8266_ops =
{
  .ifup      = esp8266_ifup,
  .ifdown    = esp8266_ifdown,
  .transmit  = esp8266_transmit,
  .receive   = esp8266_receive,
  .reclaim   = esp8266_reclaim,
};

