yunline/contest2026_062_PharosTech/drivers/net/esp8266/esp8266_netdev.c
#ifdef CONFIG_NETDEV_WIRELESS_HANDLER
static const struct wireless_ops_s g_esp8266_iw_ops =
{
  .connect    = esp8266_iw_connect,
  .disconnect = esp8266_iw_disconnect,
  .essid      = esp8266_iw_essid,
  .bssid      = esp8266_iw_bssid,
  .passwd     = esp8266_iw_passwd,
  .scan       = esp8266_iw_scan,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp8266_priv
 ****************************************************************************/

static struct esp8266_lowerhalf_s *
esp8266_priv(struct netdev_lowerhalf_s *dev)
{
  return (struct esp8266_lowerhalf_s *)dev;
}

/****************************************************************************
 * Name: esp8266_str_to_unsigned
 ****************************************************************************/

static inline int esp8266_str_to_unsigned(char **p_ptr, char end)
{
  int nbr = 0;
  char *ptr = *p_ptr;

  while (*ptr != end)
    {
      char c = *ptr++ - '0';
      if ((c < 0) || (c >= 10))
        {
          return -1;
        }

      nbr *= 10;
      nbr += c;
    }

  *p_ptr = ptr + 1;
  return nbr;
}

/****************************************************************************
 * Name: esp8266_clear_read_buffer / esp8266_clear_read_ans
 ****************************************************************************/

static inline void
esp8266_clear_read_buffer(struct esp8266_lowerhalf_s *priv)
{
  priv->bufans[0] = '\0';
}

static inline void
esp8266_clear_read_ans(struct esp8266_lowerhalf_s *priv)
{
  priv->ans = ESP8266_ANS_NONE;
}

/****************************************************************************
 * Name: esp8266_get_sock
 ****************************************************************************/

static struct esp8266_socket_s *
esp8266_get_sock(struct esp8266_lowerhalf_s *priv, int sockfd)
{
  DEBUGASSERT(sockfd >= 0);

  if (((unsigned int)sockfd) >= ESP8266_SOCKET_NBR)
    {
      return NULL;
    }

  if ((priv->sockets[sockfd].flags & SOCK_FLAGS_USED) == 0)
    {
      return NULL;
    }

  return &priv->sockets[sockfd];
}

/****************************************************************************
 * Name: esp8266_sock_closed
 ****************************************************************************/

static void esp8266_sock_closed(struct esp8266_lowerhalf_s *priv,
                                int sockfd)
{
  struct esp8266_socket_s *sock;

  DEBUGASSERT(((unsigned int)sockfd) < ESP8266_SOCKET_NBR);

  sock         = &priv->sockets[sockfd];
  sock->flags  = 0;
  sock->inndx  = 0;
  sock->outndx = 0;

  nwarn("ESP8266 socket %d closed by remote\n", sockfd);
}

/****************************************************************************
 * Name: esp8266_low_read
 *
 * Description:
 *   Read up to `size` bytes from UART. Blocks until data available.
 *   In kernel space we use read() on the fd directly.
 *
 ****************************************************************************/

static int esp8266_low_read(struct esp8266_lowerhalf_s *priv,
                            uint8_t *buf, int size)
{
  int ret;

  ret = read(priv->fd, buf, size);
  if (ret < 0)
    {
      nerr("ERROR: esp8266 low read failed: %d\n", ret);
      return -1;
    }

  return ret;
}

/****************************************************************************
 * Name: esp8266_vsend_cmd
 ****************************************************************************/

static int esp8266_vsend_cmd(struct esp8266_lowerhalf_s *priv,
                             const IPTR char *format, va_list ap)
{
  int ret;

  ret = vsnprintf(priv->bufcmd, BUF_CMD_LEN, format, ap);
  if (ret >= BUF_CMD_LEN)
    {
      priv->bufcmd[BUF_CMD_LEN - 1] = '\0';
      nwarn("ESP8266: cmd buffer too small for '%s'...\n", priv->bufcmd);
      ret = -1;
    }

  ninfo("ESP8266 TX: %s\n", priv->bufcmd);

  ret = write(priv->fd, priv->bufcmd, ret);
  if (ret < 0)
    {
      return -1;
    }

  return ret;
}

/****************************************************************************
 * Name: esp8266_send_cmd
 ****************************************************************************/

static int esp8266_send_cmd(struct esp8266_lowerhalf_s *priv,
                            const IPTR char *format, ...)
{
  int ret;
  va_list ap;

  esp8266_clear_read_buffer(priv);
  esp8266_clear_read_ans(priv);

  va_start(ap, format);
  ret = esp8266_vsend_cmd(priv, format, ap);
  va_end(ap);

  return ret;
}

/****************************************************************************
 * Name: esp8266_read
 *
 * Description:
 *   Wait for a complete line from the worker thread.
 *
 ****************************************************************************/

static int esp8266_read(struct esp8266_lowerhalf_s *priv,
                        int timeout_ms)
{
  clock_t ticks;
  irqstate_t flags = 0;
  int ret;

  ticks = MSEC2TICK(timeout_ms);
  if (ticks == 0)
    {
      ticks = 1;
    }

  do
    {
      ret = nxsem_tickwait(&priv->worker.sem, ticks);
      if (ret < 0)
        {
          return -1;
        }

      flags = spin_lock_irqsave(&priv->worker.lock);

      if (priv->worker.ans != ESP8266_ANS_NONE)
        {
          priv->ans = priv->worker.ans;
          priv->worker.ans = ESP8266_ANS_NONE;
        }

      ret = strlen(priv->worker.buf);
      if (ret > 0)
        {
          memcpy(priv->bufans, priv->worker.buf, ret + 1);
        }

      priv->worker.buf[0] = '\0';

      spin_unlock_irqrestore(&priv->worker.lock, flags);
    }
  while ((ret <= 0) && (priv->ans == ESP8266_ANS_NONE));

  ninfo("ESP8266 RX: %s (ans=%d)\n", priv->bufans, priv->ans);
  return ret;
}

/****************************************************************************
 * Name: esp8266_flush
 ****************************************************************************/

static void esp8266_flush(struct esp8266_lowerhalf_s *priv)
{
  do
    {
      esp8266_clear_read_buffer(priv);
      esp8266_clear_read_ans(priv);
    }
  while (esp8266_read(priv, ESP8266_TIMEOUT_FLUSH_MS) >= 0);
}

/****************************************************************************
 * Name: esp8266_read_ans_ok
 ****************************************************************************/

