yunline/contest2026_062_PharosTech/drivers/net/esp8266/esp8266_netdev.c
static int esp8266_read_ans_ok(struct esp8266_lowerhalf_s *priv,
                                int timeout_ms)
{
  int ret = 0;
  time_t end;

  end = time(NULL) + (timeout_ms / 1000) + ESP8266_FLOODING_OFFSET_S;

  while (priv->ans != ESP8266_ANS_OK)
    {
      ret = esp8266_read(priv, timeout_ms);

      if ((ret < 0) || (priv->ans == ESP8266_ANS_ERR) ||
          (time(NULL) > end))
        {
          ret = -1;
          break;
        }
    }

  esp8266_clear_read_ans(priv);
  esp8266_clear_read_buffer(priv);

  return ret;
}

/****************************************************************************
 * Name: esp8266_ask_ans_ok
 ****************************************************************************/

static int esp8266_ask_ans_ok(struct esp8266_lowerhalf_s *priv,
                               int timeout_ms,
                               const IPTR char *format, ...)
{
  int ret;
  va_list ap;

  va_start(ap, format);
  ret = esp8266_vsend_cmd(priv, format, ap);
  va_end(ap);

  if (ret >= 0)
    {
      ret = esp8266_read_ans_ok(priv, timeout_ms);
    }

  return ret;
}

/****************************************************************************
 * Name: esp8266_check
 ****************************************************************************/

static int esp8266_check(struct esp8266_lowerhalf_s *priv)
{
  if (priv->fd < 0)
    {
      nerr("ERROR: ESP8266 not initialized\n");
      return -1;
    }

  esp8266_flush(priv);

  if (esp8266_ask_ans_ok(priv, ESP8266_TIMEOUT_MS, "AT\r\n") < 0)
    {
      nerr("ERROR: ESP8266 not responding to AT\n");
      return -1;
    }

  return 0;
}

/****************************************************************************
 * Name: esp8266_read_ipd
 *
 * Description:
 *   Read +IPD data from UART into the socket's circular FIFO,
 *   then push assembled packets into the rxqueue.
 *
 ****************************************************************************/

static int esp8266_read_ipd(struct esp8266_lowerhalf_s *priv,
                             int sockfd, int len)
{
  struct esp8266_socket_s *sock;
  irqstate_t flags = 0;

  sock = esp8266_get_sock(priv, sockfd);

  ninfo("Read %d bytes for socket %d\n", len, sockfd);

  while (len)
    {
      uint8_t *buf;
      int size;
      uint8_t b;
      int next;

      buf  = (uint8_t *)priv->worker.rxbuf;
      size = len;
      if (size >= BUF_WORKER_LEN)
        {
          size = BUF_WORKER_LEN;
        }

      size = esp8266_low_read(priv, buf, size);
      if (size <= 0)
        {
          return -1;
        }

      len -= size;

      if (sock != NULL)
        {
          while (size--)
            {
              b = *buf++;

              next = sock->inndx + 1;
              if (next >= ESP8266_FIFO_SIZE)
                {
                  next -= ESP8266_FIFO_SIZE;
                }

              if (next == sock->outndx)
                {
                  /* FIFO full — yield briefly to let consumer drain */

                  spin_unlock_irqrestore(&priv->worker.lock, flags);
                  nxsig_usleep(100);
                  flags = spin_lock_irqsave(&priv->worker.lock);
                }

              if (next != sock->outndx)
                {
                  sock->rxbuf[sock->inndx] = b;
                  sock->inndx = next;
                }
              else
                {
                  nwarn("ESP8266 socket %d FIFO overflow\n", sockfd);
                }
            }

          /* Assemble data into netpkt and enqueue */

          esp8266_rx_avail(priv, sockfd);
        }
    }

  return 1;
}

/****************************************************************************
 * Name: esp8266_rx_avail
 *
 * Description:
 *   Drain data from a socket's circular FIFO into a netpkt and enqueue it.
 *
 ****************************************************************************/

static void esp8266_rx_avail(struct esp8266_lowerhalf_s *priv,
                              int sockfd)
{
  struct esp8266_socket_s *sock;
  netpkt_t *pkt;
  irqstate_t flags;
  int avail;

  sock = esp8266_get_sock(priv, sockfd);
  if (sock == NULL)
    {
      return;
    }

  /* Calculate available bytes */

  avail = sock->inndx - sock->outndx;
  if (avail < 0)
    {
      avail += ESP8266_FIFO_SIZE;
    }

  if (avail == 0)
    {
      return;
    }

  /* Allocate a netpkt for the received data */

  pkt = netpkt_alloc(&priv->dev, NETPKT_RX);
  if (pkt == NULL)
    {
      nwarn("ESP8266: cannot allocate netpkt for RX\n");
      return;
    }

  /* Copy data from circular FIFO into the netpkt */

  if (sock->outndx < sock->inndx)
    {
      /* Single contiguous segment */

      netpkt_copyin(&priv->dev, pkt, &sock->rxbuf[sock->outndx],
                    avail, 0);
    }
  else
    {
      /* Wrapped: copy first segment then second */

      int first = ESP8266_FIFO_SIZE - sock->outndx;
      netpkt_copyin(&priv->dev, pkt, &sock->rxbuf[sock->outndx],
                    first, 0);
      netpkt_copyin(&priv->dev, pkt, sock->rxbuf,
                    avail - first, first);
    }

  sock->outndx = sock->inndx;

  /* Enqueue for upper half to pick up — use simple linked list */

  flags = spin_lock_irqsave(&priv->rxlock);
  {
    struct esp8266_rxnode_s *node;
    node = kmm_malloc(sizeof(struct esp8266_rxnode_s));
    if (node != NULL)
      {
        node->pkt   = pkt;
        node->flink = NULL;
        if (priv->rxtail != NULL)
          {
            priv->rxtail->flink = node;
          }
        else
          {
            priv->rxhead = node;
          }
        priv->rxtail = node;
      }
    else
      {
        netpkt_free(&priv->dev, pkt, NETPKT_RX);
      }
  }
  spin_unlock_irqrestore(&priv->rxlock, flags);
}

/****************************************************************************
 * Name: esp8266_worker
 *
 * Description:
 *   Kernel thread that reads UART byte-by-byte, parses AT responses.
 *   Recognizes: OK, ERROR, FAIL, ",CLOSED", "+IPD,<id>,<len>:"
 *
 ****************************************************************************/

static int esp8266_worker(int argc, char *argv[])
{
  struct esp8266_lowerhalf_s *priv;
  irqstate_t flags;
  int rxlen = 0;

  if (argc < 1 || argv[1] == NULL)
    {
      return -EINVAL;
    }

  priv = (struct esp8266_lowerhalf_s *)
         ((uintptr_t)strtoul(argv[1], NULL, 0));

