yunline/contest2026_062_PharosTech/drivers/net/esp8266/esp8266_netdev.c
  ninfo("ESP8266 worker started\n");

  while (priv->worker.running)
    {
      uint8_t c;
      int ret;

      ret = esp8266_low_read(priv, &c, 1);

      if (ret < 0)
        {
          nerr("ERROR: worker read error %d\n", ret);
          break;
        }

      if (ret == 0)
        {
          continue;
        }

      flags = spin_lock_irqsave(&priv->worker.lock);

      if (c == '\n')
        {
          if (rxlen > 0 && priv->worker.rxbuf[rxlen - 1] == '\r')
            {
              rxlen--;
            }

          DEBUGASSERT(rxlen >= 0);
          DEBUGASSERT(rxlen < BUF_WORKER_LEN);

          priv->worker.rxbuf[rxlen] = '\0';

          if (rxlen != 0)
            {
              if (strcmp(priv->worker.rxbuf, "OK") == 0)
                {
                  priv->worker.ans = ESP8266_ANS_OK;
                }
              else if ((strcmp(priv->worker.rxbuf, "FAIL") == 0) ||
                       (strcmp(priv->worker.rxbuf, "ERROR") == 0))
                {
                  priv->worker.ans = ESP8266_ANS_ERR;
                }
              else if ((rxlen == 8) &&
                       (memcmp(priv->worker.rxbuf + 1, ",CLOSED", 7) == 0))
                {
                  unsigned int sockid = priv->worker.rxbuf[0] - '0';
                  if (sockid < ESP8266_SOCKET_NBR)
                    {
                      esp8266_sock_closed(priv, sockid);
                    }
                }
              else
                {
                  if (priv->worker.buf[0] != '\0')
                    {
                      spin_unlock_irqrestore(&priv->worker.lock, flags);
                      nxsig_usleep(100);
                      flags = spin_lock_irqsave(&priv->worker.lock);
                    }

                  if (rxlen + 1 <= BUF_ANS_LEN)
                    {
                      memcpy(priv->worker.buf, priv->worker.rxbuf,
                             rxlen + 1);
                    }
                  else
                    {
                      nerr("Worker: line too long: %s\n",
                           priv->worker.rxbuf);
                    }
                }

              /* Release the spinlock BEFORE posting the semaphore.
               * nxsem_post() may cause an immediate context switch to a
               * higher-priority thread waiting in esp8266_read().  If that
               * thread then tries spin_lock_irqsave(&worker.lock) while
               * we still hold it, we get a priority-inversion deadlock
               * because spin_lock_irqsave disables interrupts on this CPU.
               */

              spin_unlock_irqrestore(&priv->worker.lock, flags);
              nxsem_post(&priv->worker.sem);
              priv->worker.rxbuf[0] = '\0';
              rxlen = 0;
              flags = spin_lock_irqsave(&priv->worker.lock);
            }
        }
      else if (rxlen < BUF_WORKER_LEN - 1)
        {
          priv->worker.rxbuf[rxlen++] = c;
          if ((c == ':') &&
              (rxlen >= 5) &&
              (memcmp(priv->worker.rxbuf, "+IPD,", 5) == 0))
            {
              char *ptr = priv->worker.rxbuf + 5;
              int sockfd;
              int len;

              sockfd = esp8266_str_to_unsigned(&ptr, ',');
              if (sockfd >= 0)
                {
                  len = esp8266_str_to_unsigned(&ptr, ':');
                  if (len >= 0)
                    {
                      spin_unlock_irqrestore(&priv->worker.lock, flags);
                      esp8266_read_ipd(priv, sockfd, len);
                      flags = spin_lock_irqsave(&priv->worker.lock);
                    }
                }

              rxlen = 0;
            }
        }
      else
        {
          nerr("Worker: char overflow\n");
        }

      spin_unlock_irqrestore(&priv->worker.lock, flags);
    }

  ninfo("ESP8266 worker stopped\n");
  return 0;
}

/****************************************************************************
 * AT Response Parsers
 ****************************************************************************/

/****************************************************************************
 * Name: esp8266_parse_cipxxx_ans_line
 *
 * Description:
 *   Parse +CIPSTA:ip:"A.B.C.D","G.W.X.Y","E.F.G.H"
 *   Extracts the IP address (first quoted field).
 *
 ****************************************************************************/

static int esp8266_parse_cipxxx_ans_line(const char *ptr,
                                          in_addr_t *ip)
{
  int field_idx;
  char *str;
  char *ptr_next;

  str = (char *)ptr;

  for (field_idx = 0; field_idx <= 2; field_idx++)
    {
      if (field_idx <= 1)
        {
          ptr_next = strchr(str, ':');
        }
      else if (field_idx == 2)
        {
          ptr_next = strchr(str, '\0');
        }
      else
        {
          ptr_next = strchr(str, ',');
        }

      if (ptr_next == NULL)
        {
          return -1;
        }

      *ptr_next = '\0';

      switch (field_idx)
        {
          case 0:
            if (strncmp(str, "+CIP", 4) != 0)
              {
                return -1;
              }
            break;

          case 1:
            /* ip label — skip */
            break;

          case 2:
            str++;                          /* Skip first '"' */
            *(ptr_next - 1) = '\0';          /* Remove trailing '"' */
            if (inet_pton(AF_INET, str, ip) < 0)
              {
                return -1;
              }
            break;
        }

      str = ptr_next + 1;
    }

  return 0;
}

/****************************************************************************
 * Name: esp8266_parse_cwjap_ans_line
 *
 * Description:
 *   Parse +CWJAP:"SSID","BSSID",channel,RSSI
 *   Fills iwreq with AP info (used for get essid/bssid).
 *
 ****************************************************************************/

static int esp8266_parse_cwjap_ans_line(char *ptr,
                                         struct iw_point *iwp)
{
  int field_idx;
  char *ptr_next;

  for (field_idx = 0; field_idx <= 4; field_idx++)
    {
      if (field_idx == 0)
        {
          ptr_next = strchr(ptr, ':');
        }
      else if (field_idx == 4)
        {
          ptr_next = strchr(ptr, '\0');
        }
      else
        {
          ptr_next = strchr(ptr, ',');
        }

      if (ptr_next == NULL)
        {
          return -1;
        }

