yunline/contest2026_062_PharosTech/drivers/net/esp8266/esp8266_netdev.c
      *ptr_next = '\0';

      switch (field_idx)
        {
          case 0:
            if (strncmp(ptr, "+CWJAP", 6) != 0)
              {
                return -1;
              }
            break;

          case 1:
            /* SSID — skip quotes */
            ptr++;
            *(ptr_next - 1) = '\0';
            if (iwp != NULL && iwp->pointer != NULL)
              {
                strlcpy(iwp->pointer, ptr, iwp->length);
                iwp->flags = 1;
              }
            break;

          case 2:
            /* BSSID — skip quotes */
            ptr++;
            *(ptr_next - 1) = '\0';
            /* BSSID is handled separately via bssid iw_op */
            break;

          case 3:
            /* channel */
            break;

          case 4:
            /* RSSI */
            break;
        }

      ptr = ptr_next + 1;
    }

  return 0;
}

/****************************************************************************
 * Name: esp8266_parse_cwlap_ans_line
 *
 * Description:
 *   Parse +CWLAP:(ecn,"SSID",RSSI,"BSSID",channel)
 *   Fills iwreq scan result buffer.
 *
 ****************************************************************************/

/****************************************************************************
 * Name: esp8266_parse_cwlap_to_ap
 *
 * Description:
 *   Parse +CWLAP:(ecn,"SSID",RSSI,"BSSID",channel,...)
 *   into a struct esp8266_ap_s.
 *
 *   Example: +CWLAP:(3,"CMCC-501",-60,"30:1f:48:6e:f9:7e",6,10,0)
 *            ecn=3  SSID="CMCC-501"  RSSI=-60  BSSID=30:1f:48:6e:f9:7e
 *            channel=6  offset=10  calibrate=0 (ignored)
 *
 ****************************************************************************/

static int esp8266_parse_cwlap_to_ap(char *line,
                                      struct esp8266_ap_s *ap)
{
  char *p;
  char *start;
  char *end;
  int len;

  /* Skip "+CWLAP:" prefix (already verified by caller) */

  p = line;
  if (strncmp(p, "+CWLAP:", 7) != 0)
    {
      return -1;
    }

  p += 7;

  /* Parse ecn: "(ecn," */

  if (*p != '(')
    {
      return -1;
    }

  p++;
  ap->ecn = (uint8_t)strtoul(p, &p, 10);

  /* Skip comma */

  if (*p != ',')
    {
      return -1;
    }

  p++;

  /* Parse SSID: "SSID", — may contain commas inside quotes */

  if (*p != '"')
    {
      return -1;
    }

  p++;
  start = p;

  /* Find closing '"' — scan forward to find the right quote followed by ',' */

  while (*p != '\0')
    {
      if (*p == '"')
        {
          p++;
          if (*p == ',')
            {
              break;
            }
        }
      else
        {
          p++;
        }
    }

  if (*p != ',')
    {
      return -1;
    }

  end = p - 1;  /* point to closing '"' */
  *end = '\0';

  len = end - start;
  if (len > 32)
    {
      len = 32;
    }

  memcpy(ap->essid, start, len);
  ap->essid[len] = '\0';

  /* Restore the line (optional, but good practice) */

  *end = '"';

  p++;  /* skip ',' after closing quote */

  /* Parse RSSI */

  ap->rssi = (int8_t)strtol(p, &p, 10);

  /* Skip comma */

  if (*p != ',')
    {
      return -1;
    }

  p++;

  /* Parse BSSID: "xx:xx:xx:xx:xx:xx" */

  if (*p != '"')
    {
      return -1;
    }

  p++;

  if (sscanf(p, "%hhx:%hhx:%hhx:%hhx:%hhx:%hhx",
             &ap->bssid[0], &ap->bssid[1], &ap->bssid[2],
             &ap->bssid[3], &ap->bssid[4], &ap->bssid[5]) != 6)
    {
      return -1;
    }

  /* Skip past BSSID to find channel after next comma */

  p = strchr(p, ',');
  if (p == NULL)
    {
      return -1;
    }

  p++;  /* skip ',' */

  /* Parse channel */

  ap->channel = (uint8_t)strtoul(p, NULL, 10);

  return 0;
}

/****************************************************************************
 * Name: esp8266_serialize_scan_events
 *
 * Description:
 *   Serialize the cached AP list into the iw event stream format
 *   expected by wapi_scan_coll.  Each AP becomes a sequence of
 *   iw_event structs: SIOCGIWAP, SIOCGIWFREQ, IWEVQUAL, SIOCGIWESSID.
 *
 *   Event stream layout (for each AP):
 *     struct iw_event (cmd=SIOCGIWAP,    len=sizeof(iw_event))
 *     struct iw_event (cmd=SIOCGIWFREQ,  len=sizeof(iw_event))
 *     struct iw_event (cmd=IWEVQUAL,     len=sizeof(iw_event))
 *     struct iw_event (cmd=SIOCGIWESSID, len=offsetof(iw_event,u) + sizeof(iw_point))
 *       + followed by SSID string (len = essid_len)
 *
 ****************************************************************************/

static int esp8266_serialize_scan_events(struct esp8266_lowerhalf_s *priv,
                                          struct iw_point *iwp)
{
  FAR uint8_t *buf = (FAR uint8_t *)iwp->pointer;
  uint32_t remaining = iwp->length;
  uint32_t offset = 0;
  int i;

  /* Size of a "plain" event (no trailing variable-length data) */

  const uint32_t ev_plain_len = sizeof(struct iw_event);

  /* Size of the fixed header of a pointer-type event
   * (SIOCGIWESSID etc.) — the SSID string follows right after.
   */

  const uint32_t ev_point_hdr = offsetof(struct iw_event, u)
                                + sizeof(struct iw_point);

  iwp->flags = 0;

  /* Zero-length probe (wapi_scan_stat polling): just set flags
   * to the AP count and return OK.  Do not touch the buffer.
   */

  if (remaining == 0 && priv->scan_count > 0)
    {
      iwp->flags = priv->scan_count;
      return OK;
    }

  for (i = 0; i < priv->scan_count; i++)
    {
      struct esp8266_ap_s *ap = &priv->scan_aps[i];
      struct iw_event iwe;
      uint32_t needed;
      uint8_t essid_len;

      essid_len = strlen(ap->essid);

      /* Calculate total space needed for this AP's events */

      needed  = ev_plain_len;                        /* SIOCGIWAP */
      needed += ev_plain_len;                        /* SIOCGIWFREQ */
      needed += ev_plain_len;                        /* IWEVQUAL */
      needed += ev_point_hdr + essid_len;            /* SIOCGIWESSID + string */

      if (offset + needed > remaining)
        {
          return -ENOSPC;
        }

      /* Event 1: SIOCGIWAP (BSSID) */

      iwe.len = ev_plain_len;
      iwe.cmd = SIOCGIWAP;
      memcpy(iwe.u.ap_addr.sa_data, ap->bssid, ESP8266_MAC_LEN);
      iwe.u.ap_addr.sa_family = ARPHRD_ETHER;
      memcpy(buf + offset, &iwe, ev_plain_len);
      offset += ev_plain_len;

