yunline/contest2026_062_PharosTech/drivers/net/esp8266/esp8266_netdev.c
      /* Event 2: SIOCGIWFREQ (channel coded as freq.m, e=0) */

      iwe.len = ev_plain_len;
      iwe.cmd = SIOCGIWFREQ;
      iwe.u.freq.m = ap->channel;
      iwe.u.freq.e = 0;  /* 0 means "channel number" not "Hz" */
      memcpy(buf + offset, &iwe, ev_plain_len);
      offset += ev_plain_len;

      /* Event 3: IWEVQUAL (RSSI in dBm) */

      iwe.len = ev_plain_len;
      iwe.cmd = IWEVQUAL;
      iwe.u.qual.qual     = 0;
      iwe.u.qual.level    = (uint8_t)ap->rssi;
      iwe.u.qual.noise    = 0;
      iwe.u.qual.updated  = IW_QUAL_LEVEL_UPDATED | IW_QUAL_DBM;
      memcpy(buf + offset, &iwe, ev_plain_len);
      offset += ev_plain_len;

      /* Event 4: SIOCGIWESSID (pointer to following string data)
       *
       * Layout in stream:
       *   [struct iw_event header: len/cmd/u.data.flags/u.data.length/u.data.pointer]
       *   [SSID bytes]
       *
       * u.data.pointer is the byte offset from &u.data to the SSID bytes.
       * Since the SSID follows immediately after the fixed header, the
       * offset is sizeof(struct iw_point).
       */

      iwe.len = ev_point_hdr + essid_len;
      iwe.cmd = SIOCGIWESSID;
      iwe.u.data.flags   = (essid_len > 0) ? 1 : 0;
      iwe.u.data.length  = essid_len;
      iwe.u.data.pointer = (FAR void *)(uintptr_t)sizeof(struct iw_point);
      memcpy(buf + offset, &iwe, ev_point_hdr);
      offset += ev_point_hdr;

      /* Write SSID string after the event header */

      if (essid_len > 0)
        {
          memcpy(buf + offset, ap->essid, essid_len);
          offset += essid_len;
        }

      iwp->flags++;  /* Count of APs */
    }

  /* Update iwp->length to reflect actual bytes written */

  iwp->length = offset;

  return 0;
}

/****************************************************************************
 * netdev_lowerhalf Ops
 ****************************************************************************/

/****************************************************************************
 * Name: esp8266_ifup
 ****************************************************************************/

static int esp8266_ifup(struct netdev_lowerhalf_s *dev)
{
  struct esp8266_lowerhalf_s *priv = esp8266_priv(dev);
  in_addr_t ip;
  char mac_str[18];
  int ret;
  int i;

  if (priv->ifup)
    {
      return OK;
    }

  /* Check ESP8266 is alive */

  ret = esp8266_check(priv);
  if (ret < 0)
    {
      return ret;
    }

  /* Set station mode */

  ret = esp8266_ask_ans_ok(priv, ESP8266_TIMEOUT_MS, "AT+CWMODE_CUR=1\r\n");
  if (ret < 0)
    {
      nerr("ERROR: Failed to set station mode\n");
      return ret;
    }

  /* Enable multiple connections */

  ret = esp8266_ask_ans_ok(priv, ESP8266_TIMEOUT_MS, "AT+CIPMUX=1\r\n");
  if (ret < 0)
    {
      nerr("ERROR: Failed to enable CIPMUX\n");
      return ret;
    }

  /* Get IP address */

  ret = esp8266_send_cmd(priv, "AT+CIPSTA_CUR?\r\n");
  if (ret >= 0)
    {
      ret = esp8266_read(priv, ESP8266_TIMEOUT_MS);
      if (ret >= 0)
        {
          esp8266_parse_cipxxx_ans_line(priv->bufans, &ip);
          net_ipv4addr_copy(dev->netdev.d_ipaddr, (struct in_addr *)&ip);
        }
      esp8266_read_ans_ok(priv, ESP8266_TIMEOUT_MS);
    }

  /* Get MAC address */

  ret = esp8266_send_cmd(priv, "AT+CIPSTAMAC_CUR?\r\n");
  if (ret >= 0)
    {
      ret = esp8266_read(priv, ESP8266_TIMEOUT_MS);
      if (ret >= 0)
        {
          /* Response format: +CIPSTAMAC_CUR:"aa:bb:cc:dd:ee:ff" */
          char *p = strchr(priv->bufans, '"');
          if (p != NULL)
            {
              p++;
              for (i = 0; i < ESP8266_MAC_LEN; i++)
                {
                  mac_str[i * 3] = p[i * 3];
                  mac_str[i * 3 + 1] = p[i * 3 + 1];
                }
              mac_str[17] = '\0';

              sscanf(mac_str, "%hhx:%hhx:%hhx:%hhx:%hhx:%hhx",
                     &priv->mac[0], &priv->mac[1], &priv->mac[2],
                     &priv->mac[3], &priv->mac[4], &priv->mac[5]);
              priv->mac_valid = true;
              memcpy(dev->netdev.d_mac.ether.ether_addr_octet, priv->mac,
                     ESP8266_MAC_LEN);
            }
        }
      esp8266_read_ans_ok(priv, ESP8266_TIMEOUT_MS);
    }

  /* Mark interface as up */

  priv->ifup = true;
  netdev_lower_carrier_on(dev);

  ninfo("ESP8266 interface up\n");
  return OK;
}

/****************************************************************************
 * Name: esp8266_ifdown
 ****************************************************************************/

static int esp8266_ifdown(struct netdev_lowerhalf_s *dev)
{
  struct esp8266_lowerhalf_s *priv = esp8266_priv(dev);
  int i;

  if (!priv->ifup)
    {
      return OK;
    }

  /* Disconnect from AP */

  esp8266_ask_ans_ok(priv, ESP8266_TIMEOUT_MS, "AT+CWQAP\r\n");

  /* Close all sockets */

  for (i = 0; i < ESP8266_SOCKET_NBR; i++)
    {
      if (priv->sockets[i].flags & SOCK_FLAGS_USED)
        {
          esp8266_ask_ans_ok(priv, ESP8266_TIMEOUT_MS,
                             "AT+CIPCLOSE=%d\r\n", i);
          esp8266_sock_closed(priv, i);
        }
    }

  priv->ifup = false;
  netdev_lower_carrier_off(dev);

  ninfo("ESP8266 interface down\n");
  return OK;
}

/****************************************************************************
 * Name: esp8266_transmit
 *
 * Description:
 *   Send a netpkt via ESP8266 AT+CIPSEND command.
 *   Uses socket 0 for single-connection mode or allocates a socket for
 *   multi-connection mode.
 *
 ****************************************************************************/

static int esp8266_transmit(struct netdev_lowerhalf_s *dev,
                             netpkt_t *pkt)
{
  struct esp8266_lowerhalf_s *priv = esp8266_priv(dev);
  int sockfd;
  int len;
  int ret;
  uint8_t *data;
  struct esp8266_socket_s *sock;

  if (!priv->ifup)
    {
      netpkt_free(dev, pkt, NETPKT_TX);
      return -ENETDOWN;
    }

  /* Find or create a connected TCP socket */

  for (sockfd = 0; sockfd < ESP8266_SOCKET_NBR; sockfd++)
    {
      sock = &priv->sockets[sockfd];
      if ((sock->flags & SOCK_FLAGS_USED) &&
          (sock->flags & SOCK_FLAGS_CONNECTED))
        {
          break;
        }
    }

  if (sockfd >= ESP8266_SOCKET_NBR)
    {
      nwarn("ESP8266: no connected socket for TX\n");
      netpkt_free(dev, pkt, NETPKT_TX);
      return -ENOTCONN;
    }

  /* Get data from netpkt */

  len = netpkt_getdatalen(dev, pkt);
  data = netpkt_getdata(dev, pkt);
  if (data == NULL || len == 0)
    {
      netpkt_free(dev, pkt, NETPKT_TX);
      return -EINVAL;
    }

  /* Send via AT+CIPSEND */

