yunline/contest2026_062_PharosTech/drivers/net/esp8266/esp8266_netdev.c
  ret = esp8266_ask_ans_ok(priv, ESP8266_TIMEOUT_SEND,
                           "AT+CIPSEND=%d,%d\r\n", sockfd, len);
  if (ret < 0)
    {
      nerr("ERROR: CIPSEND command failed\n");
      netpkt_free(dev, pkt, NETPKT_TX);
      return ret;
    }

  /* Write the actual data */

  ret = write(priv->fd, data, len);
  if (ret < 0)
    {
      nerr("ERROR: CIPSEND data write failed\n");
      netpkt_free(dev, pkt, NETPKT_TX);
      return ret;
    }

  /* Wait for "SEND OK" */

  ret = esp8266_read_ans_ok(priv, ESP8266_TIMEOUT_SEND);

  netpkt_free(dev, pkt, NETPKT_TX);
  return (ret >= 0) ? OK : ret;
}

/****************************************************************************
 * Name: esp8266_receive
 ****************************************************************************/

static netpkt_t *esp8266_receive(struct netdev_lowerhalf_s *dev)
{
  struct esp8266_lowerhalf_s *priv = esp8266_priv(dev);
  netpkt_t *pkt;
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->rxlock);
  {
    struct esp8266_rxnode_s *node = priv->rxhead;
    if (node != NULL)
      {
        pkt = node->pkt;
        priv->rxhead = node->flink;
        if (priv->rxhead == NULL)
          {
            priv->rxtail = NULL;
          }
        kmm_free(node);
      }
    else
      {
        pkt = NULL;
      }
  }
  spin_unlock_irqrestore(&priv->rxlock, flags);

  return pkt;
}

/****************************************************************************
 * Name: esp8266_reclaim
 ****************************************************************************/

static void esp8266_reclaim(struct netdev_lowerhalf_s *dev)
{
  /* TX packets are freed in esp8266_transmit, nothing to do here */

  UNUSED(dev);
}

/****************************************************************************
 * Wireless Ops (CONFIG_NETDEV_WIRELESS_HANDLER)
 ****************************************************************************/

#ifdef CONFIG_NETDEV_WIRELESS_HANDLER

/****************************************************************************
 * Name: esp8266_iw_connect
 ****************************************************************************/

static int esp8266_iw_connect(struct netdev_lowerhalf_s *dev)
{
  struct esp8266_lowerhalf_s *priv = esp8266_priv(dev);

  /* Wi-Fi connection is initiated via the essid/passwd set + ifup flow.
   * This op triggers the actual connection if configured.
   */

  priv->connected = true;
  return OK;
}

/****************************************************************************
 * Name: esp8266_iw_disconnect
 ****************************************************************************/

static int esp8266_iw_disconnect(struct netdev_lowerhalf_s *dev)
{
  struct esp8266_lowerhalf_s *priv = esp8266_priv(dev);
  int ret;

  ret = esp8266_ask_ans_ok(priv, ESP8266_TIMEOUT_MS, "AT+CWQAP\r\n");
  if (ret >= 0)
    {
      priv->connected = false;
    }

  return (ret >= 0) ? OK : ret;
}

/****************************************************************************
 * Name: esp8266_iw_essid (set/get)
 ****************************************************************************/

static int esp8266_iw_essid(struct netdev_lowerhalf_s *dev,
                             struct iwreq *iwr, bool set)
{
  struct esp8266_lowerhalf_s *priv = esp8266_priv(dev);
  int ret;

  if (set)
    {
      /* Store SSID for later connection; actual connect happens in
       * esp8266_iw_connect or esp8266_ifup.
       */

      struct iw_point *iwp = &iwr->u.essid;

      iwp->flags = 0;
      return OK;
    }
  else
    {
      /* Get: query current AP via AT+CWJAP_CUR? */

      struct iw_point *iwp = &iwr->u.essid;

      ret = esp8266_check(priv);
      if (ret < 0) return ret;

      ret = esp8266_send_cmd(priv, "AT+CWJAP_CUR?\r\n");
      if (ret < 0) return ret;

      ret = esp8266_read(priv, ESP8266_TIMEOUT_MS);
      if (ret < 0) return ret;

      esp8266_parse_cwjap_ans_line(priv->bufans, iwp);

      esp8266_read_ans_ok(priv, ESP8266_TIMEOUT_MS);
      return OK;
    }
}

/****************************************************************************
 * Name: esp8266_iw_bssid (set/get)
 ****************************************************************************/

static int esp8266_iw_bssid(struct netdev_lowerhalf_s *dev,
                             struct iwreq *iwr, bool set)
{
  /* BSSID set: not typically used for ESP8266 (connect via SSID).
   * BSSID get: extracted from +CWJAP? response during essid get.
   * For simplicity, return OK for set and delegate to essid for get.
   */

  if (set)
    {
      return OK;
    }
  else
    {
      /* BSSID is obtained through the same +CWJAP_CUR? response.
       * We re-query here for simplicity.
       */

      struct esp8266_lowerhalf_s *priv = esp8266_priv(dev);
      struct sockaddr *ap = &iwr->u.ap_addr;
      int ret;

      ret = esp8266_check(priv);
      if (ret < 0) return ret;

      ret = esp8266_send_cmd(priv, "AT+CWJAP_CUR?\r\n");
      if (ret < 0) return ret;

      ret = esp8266_read(priv, ESP8266_TIMEOUT_MS);
      if (ret < 0) return ret;

      /* Parse BSSID (field 2 of +CWJAP:) */
      char *p = priv->bufans;
      int i;

      /* Skip to BSSID field */
      for (i = 0; i < 2; i++)
        {
          p = strchr(p, i == 0 ? ':' : ',');
          if (p == NULL) return -EINVAL;
          p++;
        }

      /* p now points to "BSSID",... */
      if (*p == '"') p++;
      if (ap != NULL)
        {
          /* BSSID format: "aa:bb:cc:dd:ee:ff" */
          uint8_t mac[6];
          sscanf(p, "%hhx:%hhx:%hhx:%hhx:%hhx:%hhx",
                 &mac[0], &mac[1], &mac[2],
                 &mac[3], &mac[4], &mac[5]);
          memcpy(ap->sa_data, mac, 6);
          ap->sa_family = AF_INET;
        }

      esp8266_read_ans_ok(priv, ESP8266_TIMEOUT_MS);
      return OK;
    }
}

/****************************************************************************
 * Name: esp8266_iw_passwd (set/get)
 ****************************************************************************/

static int esp8266_iw_passwd(struct netdev_lowerhalf_s *dev,
                              struct iwreq *iwr, bool set)
{
  /* get: password is not retrievable from ESP8266.
   * set: store password for later connect.
   */

