yunline/contest2026_062_PharosTech/drivers/net/esp8266/esp8266_netdev.c
  UNUSED(dev);
  UNUSED(iwr);

  if (set)
    {
      return OK;
    }

  return -ENOTTY;
}

/****************************************************************************
 * Name: esp8266_iw_scan
 ****************************************************************************/

static int esp8266_iw_scan(struct netdev_lowerhalf_s *dev,
                            struct iwreq *iwr, bool set)
{
  struct esp8266_lowerhalf_s *priv = esp8266_priv(dev);
  struct iw_point *iwp;
  int ret;

  if (set)
    {
      /* Start scan: send AT+CWLAP, parse all results into cache */

      int i;

      priv->scan_count = 0;
      priv->scan_valid = false;

      ret = esp8266_check(priv);
      if (ret < 0)
        {
          return ret;
        }

      ret = esp8266_send_cmd(priv, "AT+CWLAP\r\n");
      if (ret < 0)
        {
          return ret;
        }

      /* Read all +CWLAP lines and parse into the local AP cache */

      while (ret >= 0 && priv->scan_count < ESP8266_SCAN_CACHE_MAX)
        {
          ret = esp8266_read(priv, ESP8266_TIMEOUT_SCAN);
          if (ret < 0)
            {
              continue;
            }

          if (strcmp(priv->bufans, "OK") == 0)
            {
              break;
            }

          /* Parse +CWLAP:(ecn,"SSID",RSSI,"BSSID",channel,...) */

          if (strncmp(priv->bufans, "+CWLAP:", 7) != 0)
            {
              continue;
            }

          i = priv->scan_count;
          if (esp8266_parse_cwlap_to_ap(priv->bufans,
                                         &priv->scan_aps[i]) == 0)
            {
              priv->scan_count++;
            }
        }

      priv->scan_valid = true;
      return OK;
    }
  else
    {
      /* Get scan results: serialize cached AP list as iw event stream.
       * For zero-length probe (wapi_scan_stat polling), serialize_scan_events
       * returns OK with flags=AP_count — wapi_scan_stat treats this as
       * "data ready".  For a real data read, the events are written into
       * the buffer; if the buffer is too small, -ENOSPC is returned.
       */

      iwp = &iwr->u.data;

      if (!priv->scan_valid)
        {
          return -EAGAIN;
        }

      return esp8266_serialize_scan_events(priv, iwp);
    }
}

#endif /* CONFIG_NETDEV_WIRELESS_HANDLER */

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp8266_netdev_register
 *
 * Description:
 *   Register the ESP8266 network device with the NuttX network stack.
 *
 ****************************************************************************/

int esp8266_netdev_register(const char *uart_dev)
{
  struct esp8266_lowerhalf_s *priv;
  char *argv[2];
  char argbuf[32];
  int ret;
  int i;

  /* Allocate state structure */

  priv = kmm_zalloc(sizeof(struct esp8266_lowerhalf_s));
  if (priv == NULL)
    {
      nerr("ERROR: Failed to allocate esp8266_lowerhalf_s\n");
      return -ENOMEM;
    }

  /* Open UART device */

  priv->fd = open(uart_dev, O_RDWR);
  if (priv->fd < 0)
    {
      nerr("ERROR: Failed to open UART %s\n", uart_dev);
      kmm_free(priv);
      return -ENODEV;
    }

  /* Initialize semaphore for worker communication */

  nxsem_init(&priv->worker.sem, 0, 0);

  /* Set netdev ops */

  priv->dev.ops     = &g_esp8266_ops;

#ifdef CONFIG_NETDEV_WIRELESS_HANDLER
  priv->dev.iw_ops  = &g_esp8266_iw_ops;
#endif

  /* Set MTU */

  priv->dev.netdev.d_pktsize = 1500;

  /* Clear socket state */

  for (i = 0; i < ESP8266_SOCKET_NBR; i++)
    {
      priv->sockets[i].flags  = 0;
      priv->sockets[i].inndx  = 0;
      priv->sockets[i].outndx = 0;
    }

  /* Start worker thread */

  priv->worker.running = true;

  snprintf(argbuf, sizeof(argbuf), "%p", priv);
  argv[0]    = argbuf;
  argv[1]    = NULL;

  priv->worker.pid = kthread_create("esp8266_worker",
                                     CONFIG_ESP8266_NETDEV_THREAD_PRIORITY,
                                     CONFIG_ESP8266_NETDEV_THREAD_STACKSIZE,
                                     esp8266_worker, argv);
  if (priv->worker.pid < 0)
    {
      int errcode = priv->worker.pid;
      nerr("ERROR: Failed to create worker thread\n");
      nxsem_destroy(&priv->worker.sem);
      close(priv->fd);
      kmm_free(priv);
      return errcode;
    }

  /* Perform initial AT handshake */

  nxsig_sleep(1);

  esp8266_flush(priv);

  while (esp8266_ask_ans_ok(priv, ESP8266_TIMEOUT_MS, "ATE0\r\n") < 0)
    {
      nxsig_sleep(1);
      esp8266_flush(priv);
    }

  /* Register with network stack */

  ret = netdev_lower_register(&priv->dev, NET_LL_IEEE80211);
  if (ret < 0)
    {
      nerr("ERROR: Failed to register netdev: %d\n", ret);
      priv->worker.running = false;
      nxsem_destroy(&priv->worker.sem);
      close(priv->fd);
      kmm_free(priv);
      return ret;
    }

  ninfo("ESP8266 netdev registered on %s\n", uart_dev);
  return OK;
}

#endif /* CONFIG_ESP8266_NETDEV */
